MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_usart.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_usart.c
 **
 ** A detailed description is available at
 ** @link UsartGroup USART description @endlink
 **
 **   - 2018-11-27  1.0 Hongjh First version for Device Driver Library of USART.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_usart.h"
#include "hc32f46x_utility.h"

#if (DDL_USART_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup UsartGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for USART Instances. */
#define IS_VALID_USART(__USARTx__)  \
    ((M4_USART1 == (__USARTx__)) || \
     (M4_USART2 == (__USARTx__)) || \
     (M4_USART3 == (__USARTx__)) || \
     (M4_USART4 == (__USARTx__)))

/*!< Parameter valid check for USART clock prescale. */
#define IS_VALID_USART_CLK_DIV(x) \
    ((UsartClkDiv_1 == (x)) ||    \
     (UsartClkDiv_4 == (x)) ||    \
     (UsartClkDiv_16 == (x)) ||   \
     (UsartClkDiv_64 == (x)))

/*!< Parameter valid check for USART function type. */
#define IS_VALID_USART_FUNC(x)     \
    ((UsartRx == (x)) ||           \
     (UsartTx == (x)) ||           \
     (UsartCts == (x)) ||          \
     (UsartRxInt == (x)) ||        \
     (UsartTimeOut == (x)) ||      \
     (UsartSmartCard == (x)) ||    \
     (UsartSilentMode == (x)) ||   \
     (UsartTxEmptyInt == (x)) ||   \
     (UsartTimeOutInt == (x)) ||   \
     (UsartTxCmpltInt == (x)) ||   \
     (UsartParityCheck == (x)) ||  \
     (UsartNoiseFilter == (x)) ||  \
     (UsartFracBaudrate == (x)) || \
     (UsartMulProcessor == (x)) || \
     (UsartTxAndTxEmptyInt == (x)))

/*!< Parameter valid check for USART function type. */
#define IS_VALID_USART_STATUS(x) \
    ((UsartRxMpb == (x)) ||      \
     (UsartTxEmpty == (x)) ||    \
     (UsartFrameErr == (x)) ||   \
     (UsartRxNoEmpty == (x)) ||  \
     (UsartRxTimeOut == (x)) ||  \
     (UsartParityErr == (x)) ||  \
     (UsartOverrunErr == (x)) || \
     (UsartTxComplete == (x)))

/*!< Parameter valid check for USART clock mode. */
#define IS_VALID_USART_CLK_MODE(x)   \
    ((UsartExtClk == (x)) ||         \
     (UsartIntClkCkOutput == (x)) || \
     (UsartIntClkCkNoOutput == (x)))

/*!< Parameter valid check for USART stop bit. */
#define IS_VALID_USART_STOP_BIT(x) \
    ((UsartOneStopBit == (x)) ||   \
     (UsartTwoStopBit == (x)))

/*!< Parameter valid check for USART parity bit. */
#define IS_VALID_USART_PARITY_BIT(x) \
    ((UsartParityOdd == (x)) ||      \
     (UsartParityEven == (x)) ||     \
     (UsartParityNone == (x)))

/*!< Parameter valid check for USART data length. */
#define IS_VALID_USART_DATA_LEN(x) \
    ((UsartDataBits8 == (x)) ||    \
     (UsartDataBits9 == (x)))

/*!< Parameter valid check for USART data direction. */
#define IS_VALID_USART_DATA_DIR(x) \
    ((UsartDataLsbFirst == (x)) || \
     (UsartDataMsbFirst == (x)))

/*!< Parameter valid check for USART sample mode. */
#define IS_VALID_USART_SAMPLE_MODE(x) \
    ((UsartSamleBit8 == (x)) ||       \
     (UsartSamleBit16 == (x)))

/*!< Parameter valid check for USART sample mode. */
#define IS_VALID_USART_HW_FLOW_MODE(x) \
    ((UsartRtsEnable == (x)) ||        \
     (UsartCtsEnable == (x)))

/*!< Parameter valid check for USART detect mode. */
#define IS_VALID_USART_SB_DETECT_MODE(x) \
    ((UsartStartBitLowLvl == (x)) ||     \
     (UsartStartBitFallEdge == (x)))

/*!< Parameter valid check for USART mode. */
#define IS_VALID_USART_MODE(x)    \
    ((UsartUartMode == (x)) ||    \
     (UsartClkSyncMode == (x)) || \
     (UsartSmartCardMode == (x)))

/*!< Parameter valid check for USART ETU clocks number. */
#define IS_VALID_USART_ETU_CLK(x) \
    ((UsartScEtuClk32 == (x)) ||  \
     (UsartScEtuClk64 == (x)) ||  \
     (UsartScEtuClk128 == (x)) || \
     (UsartScEtuClk256 == (x)) || \
     (UsartScEtuClk372 == (x)))

